{
  "architectures": [
    "LlamaForCausalLM"
  ],
  "bos_token_id": 128000,
  "eos_token_id": [
    128001,
    128008,
    128009
    ],
  "hidden_act": "silu",
  "hidden_size": 4096,
  "initializer_range": 0.02,
  "intermediate_size": 14336,
  "max_position_embeddings": 131072,
  "model_type": "llama",
  "num_attention_heads": 32,
  "num_key_value_heads": 8,
  "num_hidden_layers": 1,
  "pad_token_id": 0,
  "rms_norm_eps": 1e-05,
  "tie_word_embeddings": false,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.42.3",
  "use_cache": true,
  "vocab_size": 128256,
  "rope_theta": 500000.0,
  "attention_bias": false,
  "attention_dropout": 0.0,
  "mlp_bias": false,
  "pretraining_tp": 1,
  "rope_scaling": {"factor": 8.0, "type": "dynamic"},
  "MOE_configs": {
    "MOE_setting": true,
    "num_experts": 5,
    "expert_hidden_size" : 1024,
    "expert_ffn_dim": 4096,
    "MOE_top_k": 2,
    "router_aux_loss_coef": 0.01,
    "router_jitter_noise" :  0.001

  }
}
